Revit 2027 API
ExportLinetypeKey.OriginalLinetypeName Property
 The original linetype name.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public string OriginalLinetypeName { get; set; }
Public Property OriginalLinetypeName As String
	Get
	Set
public:
property String^ OriginalLinetypeName {
	String^ get ();
	void set (String^ value);
}
member OriginalLinetypeName : string with get, set
Property Value
String
Exceptions
Exception | Condition
ArgumentNullException |  When setting this property: A non-optional argument was null
See Also
Reference
ExportLinetypeKey Class
Autodesk.Revit.DB Namespace